{"class_name": "Functional", "config": {"name": "model", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "registered_name": null, "name": "input_1", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 40, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 2]}, "name": "dense", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 40]}, "name": "dropout", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 40, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 40]}, "name": "dense_1", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 40]}, "name": "dropout_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 30, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 40]}, "name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 30]}, "name": "dropout_2", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 20, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 30]}, "name": "dense_3", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 20]}, "name": "dropout_3", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 10, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 20]}, "name": "dense_4", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 3, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 10]}, "name": "dense_5", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.convert_to_tensor", "trainable": true, "dtype": "float32", "function": "convert_to_tensor"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, null, 3]}, "name": "tf.convert_to_tensor", "inbound_nodes": [["dense_5", 0, 0, {"name": "x"}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.shape", "trainable": true, "dtype": "float32", "function": "compat.v1.shape"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, null, 3]}, "name": "tf.compat.v1.shape", "inbound_nodes": [["tf.convert_to_tensor", 0, 0, {"name": null, "out_type": "int32"}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "registered_name": "SlicingOpLambda", "build_config": {"input_shape": [null, null, 3]}, "name": "tf.__operators__.getitem", "inbound_nodes": [["tf.convert_to_tensor", 0, 0, {"slice_spec": [{"class_name": "__ellipsis__"}, {"start": 2, "stop": null, "step": null}]}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.reverse", "trainable": true, "dtype": "float32", "function": "reverse"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, null, 3]}, "name": "tf.reverse", "inbound_nodes": [["tf.convert_to_tensor", 0, 0, {"axis": [2], "name": null}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_1", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "registered_name": "SlicingOpLambda", "build_config": {"input_shape": [3]}, "name": "tf.__operators__.getitem_1", "inbound_nodes": [["tf.compat.v1.shape", 0, 0, {"slice_spec": {"start": null, "stop": -1, "step": null}}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.concat_1", "trainable": true, "dtype": "float32", "function": "concat"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [[null, null, 1], [null, null, 3]]}, "name": "tf.concat_1", "inbound_nodes": [[["tf.__operators__.getitem", 0, 0, {"axis": -1}], ["tf.reverse", 0, 0, {"axis": -1}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.concat", "trainable": true, "dtype": "float32", "function": "concat"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [[2], [[], []]]}, "name": "tf.concat", "inbound_nodes": [[["tf.__operators__.getitem_1", 0, 0, {"axis": 0}], [["_CONSTANT_VALUE", -1, 2, {"axis": 0}], ["_CONSTANT_VALUE", -1, 2, {"axis": 0}]]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.reshape", "trainable": true, "dtype": "float32", "function": "reshape"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, null, 4]}, "name": "tf.reshape", "inbound_nodes": [["tf.concat_1", 0, 0, {"shape": ["tf.concat", 0, 0]}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.linalg.band_part", "trainable": true, "dtype": "float32", "function": "linalg.band_part"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, null, 2, 2]}, "name": "tf.linalg.band_part", "inbound_nodes": [["tf.reshape", 0, 0, {"num_lower": -1, "num_upper": 0, "name": null}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.math.multiply", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, null, 2, 2]}, "name": "tf.math.multiply", "inbound_nodes": [["tf.linalg.band_part", 0, 0, {"y": [[1.0, 0.0], [0.0, 1.0]]}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.math.square", "trainable": true, "dtype": "float32", "function": "math.square"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, null, 2, 2]}, "name": "tf.math.square", "inbound_nodes": [["tf.math.multiply", 0, 0, {"name": null}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.math.abs", "trainable": true, "dtype": "float32", "function": "math.abs"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, null, 2, 2]}, "name": "tf.math.abs", "inbound_nodes": [["tf.linalg.band_part", 0, 0, {}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_1", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": []}, "name": "tf.math.multiply_1", "inbound_nodes": [["_CONSTANT_VALUE", -1, 2.0, {"y": ["tf.math.square", 0, 0], "name": null}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, null, 2, 2]}, "name": "tf.__operators__.add", "inbound_nodes": [["tf.math.abs", 0, 0, {"y": ["tf.math.multiply_1", 0, 0], "name": null}]]}, {"module": "keras.layers", "class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAQAAAADAAAA8ywAAACXAHQBAAAAAAAAAAAAAGoBAAAAAAAAAABkAXwApgIA\nAKsCAAAAAAAAAABTACkCTvoKYWJjZC0+YWJkYykC2gJ0ZtoGZWluc3VtKQHaAXdzAQAAACD6K2M6\nL1VzZXJzL1Bpb3RyZWsvUmVwb3MvTUdSL3RlbnNvck5ldHdvcmsucHnaCXRyYW5zcG9zZXIHAAAA\nDQAAAHMUAAAAgADdDA6MSZBsoDHRDCXUDCXQBCXzAAAAAA==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "registered_name": null, "build_config": {"input_shape": [null, null, 2, 2]}, "name": "lambda", "inbound_nodes": [[["tf.__operators__.add", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.linalg.matmul", "trainable": true, "dtype": "float32", "function": "linalg.matmul"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, null, 2, 2]}, "name": "tf.linalg.matmul", "inbound_nodes": [["tf.__operators__.add", 0, 0, {"b": ["lambda", 0, 0]}]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["tf.linalg.matmul", 0, 0]]}, "keras_version": "2.15.0", "backend": "tensorflow"}